app/controllers/find_movies_with_same_director_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Dennis' LIMIT 1
---
  def show
    @movie = Movie.find(params[:id])
    if @movie.director != nil && @movie.director != ""
      # list of similar movies but with the reference movie included
      @similar_movies = Movie.find_similar_movies(params[:id], @movie.director)